app/views/estoques/_estoque.html.erb

SELECT "produtos"."nome" FROM "produtos" WHERE "produtos"."id" = $1  [["id", 1]]
---
  <td>
    <%= Produto.where(:id => estoque.produto_id).pluck(:nome)[0] %>