app/views/home/index.html.erb

        <tr>
          <td><%= @produtos.where(:id => e.produto_id).pluck(:nome)[0] %></td>
---
SELECT "produtos"."nome" FROM "produtos" WHERE "produtos"."id" = $1  [["id", 1]]