app/controllers/estoques_controller.rb

  def index
    @estoques = Estoque.all
---
SELECT "estoques".* FROM "estoques"

  def create
    @estoque = Estoque.new(estoque_params)

    respond_to do |format|
      if @estoque.save
---
INSERT INTO "estoques" ("preco_kg", "quantidade", "desc", "lote", "created_at", "updated_at", "produto_id") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["preco_kg", 22.9], ["quantidade", 23.0], ["desc", "Teste"], ["lote", 23], ["created_at", "2024-09-06 19:36:51.729443"], ["updated_at", "2024-09-06 19:36:51.729443"], ["produto_id", nil]]

    def set_estoque
      @estoque = Estoque.find(params[:id])
---
SELECT "estoques".* FROM "estoques" WHERE "estoques"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def set_produto_options
    @produto_options = Produto.all.pluck(:nome, :id)
---
SELECT "produtos"."nome", "produtos"."id" FROM "produtos"