app/controllers/home_controller.rb

SELECT "estoques".* FROM "estoques"
SELECT "produtos".* FROM "produtos"
---
  def index
    @estoques = Estoque.all
    @produtos = Produto.all