app/controllers/produtos_controller.rb

  def index
    @produtos = Produto.all
---
SELECT "produtos".* FROM "produtos"

  def create
    @produto = Produto.new(produto_params)

    respond_to do |format|
      if @produto.save
---
INSERT INTO "produtos" ("nome", "desc", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["nome", "CAMARÃO 7 BARBAS"], ["desc", ""], ["created_at", "2024-09-06 02:42:12.432121"], ["updated_at", "2024-09-06 02:42:12.432121"]]

    def set_produto
      @produto = Produto.find(params[:id])
---
SELECT "produtos".* FROM "produtos" WHERE "produtos"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]